{
    "properties": {
        "name": "Aerospace Engineering",
        "school": "Instituto Superior Técnico, Universidade de Lisboa",
        "ects": 180,
        "courses": [
            {
                "name": "Entrepreneurship, Innovation and Technology Transfer",
                "description": "1. innovation, entrepreneurship and competitiveness. 2. innovation factors and innovation processes 3. Transfer of intellectual technology and property. Interconnects technology/product and service/market. 5. product development process and your organization. A. creativity and product planning. B. user needs and product specifications. C. C. Generation, selection and test of concepts. D. product architecture. E. industrial design, engineering and prototyping 6. risk management. Identification and assessment of risk factors and contingency plans.7 Design for Manufacture/assembly, project for ambiente.8. Project for cost, “target price/target cost” 9. Economic Analysis and sources of financing 10. Legal aspects associated with the creation of business11. Business plan. Marketingb's plan. Production Plan/operations C. Management Plan and organization. Financialplan 12. Project discussions/business plan.",
                "ects": 6.0
            },
            {
                "name": "Advanced Heat Transfer",
                "description": "1. thermal radiation in participating media. Radiation heat transfer equation. Radiation properties of gases: Fundamentals. Models for calculating the radiative properties of gases. Model mixing gray gases. Total Emissivity and absorbency: Hottel graphics and Leckner correlations. Average absorption coefficient. Radioactive properties of particles: Fundamentals. Mie theory. Simplified Theory. Radioactive properties of coal and soot particles. Radiation in enclosed enclosures with a participating medium. Zone method. Equivalent average length of rays. Equations of radiosity and electrical analog. Monte Carlo method. Solar radiation. 2. heat transmission with phase change. Fusion and solidification: physical mechanisms. Simplified model for one-dimensional case. Free boiling and boiling in forced convection: physical mechanisms and empirical correlations. Film condensation and droplet condensation: physical mechanisms and empirical correlations. Numerical Methods in heat transmission. Finite differences, finite elements and finite volumes. Discretization of the heat conduction equation through the finite volume method. Border conditions. Solution algorithm. Boundary layer equations. Solution of boundary layer equations. Navier-Stokes equations. Discretization of a transport equation through the method of finite volumes. Pressure calculation. Pressure coupling? Speed: simple algorithm. Turbulent regime. Examples of application to forced and natural convection. Finite volume method for thermal radiation.4. Seminars on a topic to be selected (e.g. heat transmission in porous media; bio-heat transfer; heat transmission to micro/nano scale; reverse methods in heat transmission).",
                "ects": 6.0
            },
            {
                "name": "Instrumentation and Measurement",
                "description": "1) Fundamentals of Instrumentation and Measurement International metrological system: errors. Statistical considerations. Units and patterns. Calibration. Functional modules for instrumentation: instrumentation and isolation amplifiers; RMS converters; synchronous phase meshes; D/A and A/D converters. Measurement principles, methods and procedures: analog and digital instrumentation; signal sampling; signal heterodination. Data acquisition systems. 2) measurement of electrical domain quantities measuring instruments: analog voltmeters and ammeters. Wattimeters. Digital multimeter. Time/frequency counter. Generators of functions and impulses. Frequency synthesizers. Analog and digital oscilloscope. Spectra analyzers. Lock-in amplifier. Measurement of electrical quantities. Resistance measurement and impedance.3) measurement transducers fundamental concepts. Force and position transducers: extensometers and LVDT. Signal conditioning. Linearization of characteristics.4) virtual instruments and automatic measurement systems. Fundamental concepts. Communication Standards for instruments. Acquisition Systems: computer equipment and programs.",
                "ects": 7.5
            },
            {
                "name": "Propulsion",
                "description": "Calculation of propulsion force. Analysis of the theoretical and actual cycles of the statorreactor, turborreactor, double-flow turborreactor, turboprop and aeronautical gas turbine. Tubeiras. Combustion chambers. Euler's equations of turbomachins. Dimensional analysis of turbomachins. Southern plane and shovels plane. Shovels. Correlation of Howell and Lieblein. Correlation of Ainley-Matthieson and Soderberg. Zweifel criterion. Speed triangles. Radial balance theory. Axial compressors. Study of losses. Multistage compressors. Design of a subsonic axial compressor. Transonic floors. Centrifugal compressors. Axial turbines. Aerodynamic Study of propellers. Acting disco theory. Simplified Theory of Rankine-Froude. Calculation of optimal yield and speed on the actuating disc. Theory of Alar profile elements. Support line theory. Helicopter propellers. Introduction to blast engines. Fuel metering systems: carburettors and injection systems. Ignition systems. Aspiration. Introduction to rocket engines. Propulsion force and specific impulse. Operating parameters of rocket motors. Income. Flight Mechanics of a rocket. Multi-story rocket. Study of processes in the combustion chamber and tubeira. Sub-expansion and over-expansion. Heat transfer on a tube. Empirical correlations. Transient heat conduction on the tubeira wall. Propellants used in liquid fuel chemical rockets. Fuel injection systems. Model of evaporation of fuel drops.",
                "ects": 6.0
            },
            {
                "name": "Applied Mechanics II",
                "description": "Kinematics of rigid bodies: rotation; flat movement; instantaneous rotation center; absolute and relative acceleration; General movement; three-dimensional movement of a particle in relation to a rotating axis system. Flat movement of rigid bodies: movement equations; angular moment; d'Alembert principle; work and energy; Rigid body system; energy conservation and angular moment. Kinetics of rigid bodies in three dimensions: angular moment and kinetic energy of a rigid body to three dimensions; movement of a gyroscope; Euler angles; movement free of an axisometric body. tensorial calculation: transformation laws; invariance in relation to coordinate systems; Metric; physical components of tensioners; covariant derivative; curvilinear acceleration; differential operators.",
                "ects": 6.0
            },
            {
                "name": "Fundamental Course in Mechanical Processing of Materials",
                "description": "Introduction to manufacturing processes. Theory of Plasticity and viscoplasticity. Phenomenological Aspects of mechanical behavior of metallic materials. Mechanical Characterization tests. Influence of temperature and deformation speed. Empirical equations voltage-extension/deformation speed. Friction, wear and lubrication, tribological characterization tests. Uniform energy and elemental slice methods. Mechanical processing of metal materials. Introduction to technological processes of plastic deformation in the mass. Introduction to technological processes of plastic sheet deformation. Introduction to technological processes of sheet metal cutting. Introduction to technological machining processes. Selection of mechanical processing technologies of metal materials according to attributes related to materials, the type of product (geometry, weight, dimensional tolerances, roughness), the manufacturing series and the cost factor. Environmental framework.",
                "ects": 6.0
            },
            {
                "name": "Turbomachinery",
                "description": "Fundamental equations of the relative flow in the turbomachine rotor. Euler equation. Energy Transfer and income, its definition and meaning. General methods of analysis of flow in turbomachines. Study of the main types of turbomachines. Pelton turbines. Pumps, fans and radial compressors. Introduction to the theory of axial Turbomachines (shovels, radial balance, actuating disc). Axial turbines (hydraulic, steam and gas). Pumps, fans and axial compressors. Wind turbines. Project of a turbomachine (usually a radial pump). Laboratory test of a radial fan, including the detailed study of the interior flow.",
                "ects": 6.0
            },
            {
                "name": "Decision Support Models",
                "description": "The problem of decision-making: definition of decision-making problem. Importance in egestan engineering. Characteristics of the context of decision-making strategies. Uncertainty and complexity. Value and risk. what is decision analysis (AD)? AD's target. The seven fundamental steps of AD. AD schools and theoretical foundations. Intervention Strategies: From the paradigm of optimization to the learning paradigm. Value Analysis utility. Concepts, Models, techniques and software for decision support: 1. Decision trees and influence diagrams; study cases; precision tree.2. Bayesian networks; study cases; netica.3. Probability Modeling and risk analysis; case studies; @ risk.4. Cognitive mapping; study cases; explorer.5. Multicrittery evaluation; study cases; macbeth.6. Resource allocation and negotiation; study cases; probe and Macbeth.",
                "ects": 6.0
            },
            {
                "name": "Materials Science",
                "description": "1-Introduction 2? Materials-primas.3? Mechanical properties of materials. 4? 4? Composite Materials. 5? Structure of material.6? Polymericos.7-solidification.8? Atomic diffusion in solide.9? Fases.10 balance diagrams? Iron and Steel. Material Processing Technologies. 12? Recycling of materials.13? Other properties of materials.",
                "ects": 6.0
            },
            {
                "name": "Digital Signal Processing",
                "description": "Part I? Discrete transformations and filtragem1. Discrete Systems and signals. Processed Z3. Discreet fourier4. Digitalpart II filtration? Signal processing based on model5. Random signs 6. Pet parâmetros7. Adaptive filtration system",
                "ects": 6.0
            },
            {
                "name": "Maintenance and Safety",
                "description": "Reliability introduction. General objectives of the reliability theme. Breakdown concept. Failure rate. Analysis of occurrence of faults and Pareto diagram. Risk function. Reliability of components. Tub bend. Exponential distribution. Distribution of Weibull. Component replacement policy. Inventory management. Failure Analysis and Prevention, mode analysis and failure effects. Fault tree analysis. Maintainability. Availability. maintenance finish maintenance. Evolution of maintenance function. Maintenance types. Maintenance levels, maintenance organization and coding of equipment. Spare parts. Order of work. Priority degrees. Work preparation. Equipment history. Machine notebook. Circuit of work orders. Maintenance planning and planning-maintenance policies. Preventive, systematic, corrective and conditional maintenance. Project maintenance and timely. Selection of a maintenance program. Quantitative methods in maintenance analysis ABC. Activity Networks. Equipment replacement policies. Spare parts and stock management of spare equipment. direct maintenance costs. Indirect costs. Maintenance costs and stopping costs and their optimization. Life Cycle Cost - LCC. maintenance managementindicators and ratios. Spare parts management (introduction). Sub-contracting. It in maintenance.",
                "ects": 6.0
            },
            {
                "name": "Differential and Integral Calculus II",
                "description": "Algebraic and topological structure of R<sup> N </sup>. Functions of r <sup> N </sup> in r <sup> M </sup>: limit and continuity. Differentiability. Partial derivative. Derived from the compound function. Taylor's theorem in r <sup> N </sup> and application to extreme study. Inverse function and implicit function theorems. Conditioned extremes. Multiple integrals: Fubini theorem, variable change theorem, applications to the calculation of physical quantities. Line integrals: Integrals of scalar fields and vector fields; fundamental theorem of calculation for line integrals, gradient and potential scalar fields; green theorem. Surface integrals: Integrals of scalar fields and vector field flows; Stokes divergence theorem.",
                "ects": 7.5
            },
            {
                "name": "Space Environment",
                "description": "This discipline is the sequence of “interactive phenomena” that is not required as precedence. It continues the pluritematic approach involving mechanics, thermodynamics electromagnetism in fluids and solids. Complements the organization of the aerospace engineering studies plan with an emphasis on Mathematics-Physics in the first 2 years passing to applications in engineering in the last 3, by a joint mathematical-Physics-engineering approach that: (I) is based on the mathematics and physics of the first 2 years as introduction to more advanced methods and models, which (Ii) are (immediately applied to engineering problems that can only be solved used these methods. My teaching method is based on the student's understanding of the concepts and their understanding of the concepts. Examples: non-linear oscillations, parametric resonance, large amplitude waves, heterogeneous and/or anisotropic media phenomena, non-stationary processes, electromechanical dines and other phenomena and equipment that occur or are used in space environment.",
                "ects": 6.0
            },
            {
                "name": "Complex Analysis and Differential Equations",
                "description": "Complex analysis. Complex plan. Numerical series. Absolutely convergent series. Series of powers. Differentiability, holomorphic functions. Add-ons on series of functions, analytical functions. Cauchy's theorem. Homotopia. Cauchy's full formula. Isolated singularities. Laurent series. Waste theorem. Improper integrals. Convergence theorems. Leibniz rule. ordinary differential equations. First order equations. Linear, separable, exact equations and integral factors. Existence and uniqueness of solution. Solution Extension. Resolution of linear ordinary equations systems. Exponential matrix. Formula of variation of constants. Fourier series. superior order linear equations. Fourier series convergence. Partial differential equations. Variable separation method. Heat equation. Laplace equation. Wave equation, transformed from Laplace.",
                "ects": 7.5
            },
            {
                "name": "Electromechanical Oscillations",
                "description": "1. analogies between mechanical systems and electrical circuits. Linear and non-linear free oscillations with and without damping. Forced oscillations, beats and resonance. Parametric and non-linear.2. Oscillators with various degrees of freedom, oscillations and multiple resonance. Coupled oscillators and oscillation suppress.3. Radioactive disintegration chains and oscillator sequences.4. Transmission lines. We rely on self-excited and generating magnetic fields. Mechanical and electrical systems with forks and chaotic regimes.6. Olinear and non-linear deflection of ropes, membranes, bars, beams and elastic plates.",
                "ects": 6.0
            },
            {
                "name": "Computer Architecture",
                "description": "Historical perspective; data processing unit, control unit, central processing unit, elementary architectures of a computer system, instruction set architecture, assembly language programming, interruptions, RISC and CISC CPUs architectures, input/output units, memory units, evolution of computer architectures.",
                "ects": 6.0
            },
            {
                "name": "Probabilistic and Statistics",
                "description": "<I> basics:</i> random experience. Events. Frequent and subjective concepts of probability. Kolmogorov's axiomatic. Probability conditioned. Bayes theorem independence.<i> random variables:</i> distribution function. Discrete and continuous random variables. Expected value, variance and other parameters. <I> Joint distributions and add-ons:</i> Joint, marginal and conditional distributions. Independence. Correlation. Approaches between distributions. Central boundary theorem. Law of large numbers. <i> Sampling and punctual estimation:</i> Descriptive versus inductive statistics. Random sample. Statistics. Punctual pet. Properties of estimators. Method of maximum verosimility. Average and variance sample distributions. <I> pets by intervals:</i> basics. Reliable intervals for normal and other population parameters. <I> hypothesis tests:</i> basics. Hypothesis tests for parameters of normal populations and others. Pearson adjustment tests and independence in contingency tables.<i> simple linear regression:</i> estimation by the minimum square method and their properties. Inference in the simple linear regression model. Determination coefficient and empirical analysis of waste.",
                "ects": 6.0
            },
            {
                "name": "Project Management",
                "description": "1.nature of the project and project-based organizations. 2. project management and teams; organization and coordination. 3. conflict management and negotiation. 4. planning and programming. 4.1. pert, CPM, Gantt. 4.2. use of computer tools. 5. allocation of resources and budgeting. 5.1. Budgeting Models. 5.2. cost classification, cost, results and investment centers. 5.3. cost technological models. 6. monitoring and control (cost, time, quality/performance). 7. linear programming applied to project management. 8. implementation of management systems by total quality. 8.1. quality objectives and prospects. 8.2. statistical control tools. 8.3. management by total quality. 8.4. Planning the implementation of a total quality management system. 9. implementation of a total productive maintenance system. 9.1. maintenance typology and maintenance costs. 9.2. availability, reliability, 'manutibility' and 'capability'. 9. 3.tpm-'total productive maintenance': objectives, principles and overall efficiency of equipment. 9.4. planning the implementation of a TPM system.",
                "ects": 6.0
            },
            {
                "name": "Navigation Systems",
                "description": "1) radio-navigation systems: a) radio-navigation principles, b) terrestrial navigation systems, c) global satellite navigation systems. 2) characterization of radio-navigation satellites: a) GPS system, b) Galileo system. 3) GPS receiver characterization: a) receiver structure, b) acquisition, c) phase tracking and code meshes, d) pseudo-distances errors, and) precision dilution. 4) representation of linear systems in state space. 5) Kalman filtration: a) pet concept, b) linear filtration, c) non-linear filtration. 6) navigation equation solution: a) coordinate systems, b) solution by minimum quadratic method, c) solution by Kalman filter. 7) additional GPS topics: a) differential GPS, b) pseudolites, c) integrity monitoring, d) integrated navigation systems.",
                "ects": 6.0
            },
            {
                "name": "Systems Programming",
                "description": "History and Architecture of operating systems, called the system. Processes and lead wires: launch, identification, process states, elimination, waiting for completion, process groups, execution wire models, dispatch and process staggering models, process Environment, Linux startup. Communication between processes: Communication Models, tube/queue communication, signals and shared memory, sockets. synchronization between processes: Racing problem, critical regions, traffic lights synchronization mechanisms, mutexes and manager. Memory management: allocation, pagination and segmentation. File Systems: EXT, ISO9660, VFS and NFS file systems. Software libraries, make tools and SCCS, RPM distribution file. device management: Programmed and interrupt I/O controllers, Linux modules.",
                "ects": 7.5
            },
            {
                "name": "Management",
                "description": "1. introduction to management. 2. organizations and human resources-2.1 culture, ethics and structure of organizations. 2.2 Human Resource Management. 3. the economic environment-3.1 general concepts. 3.2 Macroeconomics: economic agents and economic flows; macroeconomic variables. 3.3 microeconomics: markets, demand and supply; economies of scale, range and experience; market structures; the role of the state. 4. The financial Information-4.1 organization of financial information: Role and foundations of accounting; 4.2 balance sheet and statement of results; 4.3 analysis of economic-financial ratios; 4.4 basic notions of cost 4.5. Cost-volume analysis-result.5. Analysis of investment projects-5.1 How to Calculate current and future values: capitalization and upgrade; inflation and real rates; nominal and effective interest rates; annuities and perpetuities. 5.2 Analysis of the profitability of investment projects: cash-flows; refresh rate; net current value; internal profitability rate; investment recovery period; profitability index. 6. strategic management-6.1 Introduction: The process of formulating and implementing the strategy. 6.2 Situation Analysis: external analysis-General and transactional envelopes; internal analysis; SWOT matrix. 6.3 Strategy Formulation: Corporate level strategy; business level strategy; functional and operational level strategy. 7. Marketing - 7.1 Introduction: Fundamental concepts; consumer behavior. 7.2 Segmentation, targeting and positioning (STP). 7.3 Marketing Mix: product; price; promotion/communication; distribution.",
                "ects": 4.5
            },
            {
                "name": "Risk Analysis",
                "description": "Definition and quantification of risk. Methodology of analysis and risk management. Identification of hazards or risk factors. Qualitative aspects of risk analysis. Preliminary hazard analysis. Method of Analysis of fault modes and their effects (FMEA). Hazard and operationality study (HAZOP). Quantification and analysis of systems. Systems Analysis and fault tree construction. Quantification of system reliability. Calculation of fault trees with computer support. Reliability diagrams and event trees introduction to reliability of non-repairable components and systems. Introduction to the availability of components and systems maintained. Introduction to Bayesian networks. Influence diagrams and decision trees. Bayesian networks in risk analysis. modeling uncertainties. Monte Carlo methods for Risk Analysis and Uncertainty propagation. Sensitivity analysis. incorporation of human factors in risk analysis. Quantification of human reliability-human reliability assessment method hear T.T. THERP method.",
                "ects": 6.0
            },
            {
                "name": "High Frequency Electronics",
                "description": "1. microwave and millimeter wave characteristics. microwave planar circuits and applications. 2. dispersion matrix. Interfaces with impedance and admittance arrays. Transmission lines. Microtape lines. Concentrated elements. 3. impedance adaptation meshes and filtration. Loss-free adaptation networks. Adaptation of impedances with concentrated and distributed elements using Smith's letter. Impedance transformation. Filters with distributed elements. Synthesis and optimization. CAD tools. 4. amplifiers. Transducer gain of an active port. Constant gain circumferences. Noise factor. Constant noise factor circumferences. Nonlinear behavior. Dynamic range. Polarization. Power amplifiers. Amplification classes. Composite assemblies. Couplers. Implementation in monolithic ICs and hybrid circuits. 5. mixers. Analog Diode mixers. Balanced structures. Hybrid quadrature and ring. Mixers with image rejection. Active mixers. Implementation in monolithic integrated circuit and hybrid circuits. 6. oscillators. The concept of conductance or negative resistance applied to the design of oscillators with transistors. Simulation techniques. Design of oscillators for maximum added power. Oscillation stability and synchronization. Voltage Controlled Oscillators (VCOs) 7. ECL logic. General about the family ECL family ECL 10K: static and dynamic characteristics. Design rules for logic systems with ECL technology. ECL circuit interconnection techniques: unfinished lines; parallel and serial finished lines; attenuation series resistance lines. Reflectometry in the field of time.",
                "ects": 6.0
            },
            {
                "name": "Digital Systems",
                "description": "Numbering Systems: binary, octal and hexadecimal numbering, arithmetic operations, decimal and alphanumeric codes. Logic Circuits: binary logic and logic ports, Boole algebra, logical functions, normalized forms of representation, uncompletely specified functions, algebraic minimization and Karnaugh maps, circuits with NAND and and nor ports. Basic elements of technology: Logical families, Tri-State ports, propagation times, polarization logic. Combinational Circuits: encoders, decoders, multiplexers, demultiplexers, comparators, Sumers and subtractors. Basic sequential circuits: SR and D latches, SR, JK, D and T flip-flops, master-slave and edge-flops, temporal analysis and temporal synchronization. Records and counters: Simple registers, displacement registers, multimode registers, synchronous and asynchronous counters, counters synthesis, linkage and expansion of counters. Synchronous sequential circuits: Mealy and Moore machines, state diagrams and tables, state coding, classical synthesis, alternative methods of synthesis, state minimization. Memories: Ram, Rom and prom. Programmable logic: PLA, pal, FPGA. data units and control units in digital systems.",
                "ects": 6.0
            },
            {
                "name": "Metal Cutting",
                "description": "1. Introduction to machining processes. 2. turning. Turning principles. Tools. tools. Main cutting parameters. Wear, breakdown and tool life. Cutting fluids. Surface finish. Cutting economy. 3. milling. Principles of milling. Tools. tools. Main cutting parameters. Wear, breakdown and tool life. Cutting fluids. Surface finish. Cutting economy. 4. other machining processes: Drilling and broaching. 5. machining with abrasives. Types of machining with abrasives. Grinding; grinding principles, tools, main cutting parameters, wear, failure and tool life. Cutting fluids. Surface finish. Cutting economy. 6. high speed machining. 7. machining of non-metallic materials. 8. Introduction to Non-conventional machining processes. 8.1. electrochemical machining. 8.2. electro-erosion. Applications.",
                "ects": 6.0
            },
            {
                "name": "Unmanned Aerial Vehicles",
                "description": "1-Introduction to unmanned aerial vehicles (UAV) what are vants? Configuration and types of vehicles: fixed wing, Mono and multi-rotor, VTOL. Applications 2-Introduction to the design and selection of conceptual stage systems. Design: System Selection. Aerodynamics and structure. Cinematic and dynamic of vants. Ground Control Station. Communication systems.3-modern design of linear controls in state space, controllability and observability. Linear refeeding of state variables. Separation theorem. Optimal quadratic linear control-formulation and solution of the problem. Exemplos.4-design of automatic pilots design of automatic pilots. Restrictions on performance and performance. Side autopilot and longitudinal. 5-sensors for suction meters. Gyroscopes. Pressure sensors. Compasses. GPs. Proximidade.6 sensors-dynamic observer State pet. Kalman filter in continuous and discrete time. Sensory fusion. Attitude pet. 7-Introduction to Non-linear control introduction to non-linear systems. Linearization. Stability of Lyapunov-first and second meted.8-driving cinematic and dynamic driving models. Driving for a straight. Hovering.9-non-linear control and navigation systems tracking trajectories and paths. Time to crash. Landing needs. Non-linear navigation.10-trajectory planning trajectory manager. Dubins trajectories. Algorithms with track points. Roofing algoriths.11-applications and future of aerial photography. Agriculture. Environmental monitoring and monitoring. Support for fire prevention. Communications relay. Developments in aircraft configurations. New paradigms.",
                "ects": 6.0
            },
            {
                "name": "Flight Control",
                "description": "Flight control: definitions and objectives. Terminal control elements. Equations and analysis of movements. Flight qualities. Automatic control: Feed Control, classic methods, modern control, digital control. Automatic pilots: increased stability, attitude control, trajectory control, automatic landing. Complementary elements: Sensors and actuators, atmospheric disturbances, aerospace, robust and adaptive control.",
                "ects": 6.0
            },
            {
                "name": "Electric and Electromechanical Systems",
                "description": "Basic notions of circuits and electrical installations. Continuous current and sinusoidal alternating current circuits. Most common three-phase installations. Notion of active and reactive power. Some aspects of the selection of elements of electrical installations, conductors and protections. Introduction to Magnetic circuits and notions of properties of magnetic materials used in electrical machines. Introduction to Transformers. Practical aspects of your analysis and application. Principles of electromechanical energy conversion. Forces and binary. Introduction to rotary electric machines. Elementary concepts. Introduction to AC and DC machines. Concept of rotating field. Synchronous Machines. Constructive aspects. Principle and equivalent circuit in permanent regime. Features and applications. Induction machines. Constructive aspects. Equivalent circuit on a permanent basis. Features and applications. Direct current machines. Introduction. Features. Universal series motor. Elementary notions of control and protection of direct current machines, synchronous machines and induction machines in some applications.",
                "ects": 6.0
            },
            {
                "name": "Mechanics and Waves",
                "description": "1. movement description in space and time. Cinematic. Relative movement. Dynamics (Newtonian mechanics): principle of inertia; concepts of mass and strength; action and reaction2.conservation laws and symmetries of space-time. Conservation of Energy (mechanical), linear moment and angular moment. Kinetic energy and potential energy.3.mechanical interaction between systems. External forces. Mass center. Work of a force. Conservative and dissipative systems. Movement of particle systems.4.movement of the rigid body: angular speed and acceleration; rotation of the rigid body; torque or moment of a force. Moment of inertia 5.stability of systems. Simple harmonic oscillations. Oscillations with friction and force.6.waves. Wave propagation. Propagation speed, amplitude, frequency and phase. Wave equation. Transverse waves and longitudinal waves.7.fluids: hydrostatic pressure. Principle of archimedes.8.einstein's strict relativity. Light speed in vacuum. Transformation of Galilee and transformation of Lorentz. Time dilation and space contraction. E = MC².",
                "ects": 6.0
            },
            {
                "name": "Mechanics of Materials",
                "description": "Introduction of the concept of tension. Normal and cutting stresses. Tension in an oblique plane. Limit voltage and safety factor. Introduction of the concept of deformation. Normal voltages. Hooke's law. Deformation of axially loaded components. Statistically undetermined problems. Stresses and deformations in circular section torsion shafts. Stably indeterminate veins. Draft twisting veins. Revision of calculation and mapping of stress diagrams and Arrow moments. Stresses and elastic deformations in pure bending. Deformations in a cross section. Eccentric axial loading on a symmetry plane. Asymmetric bending. General case of eccentric axial charging. Normal and cutting stresses under the action of cross loads. Stresses under the action of combined loads. Voltage and deformation transformations. Main voltages. Maximum cutting voltage. Mohr circle. Project beams and veins to the resistance. Calculation of beam deformed by integration. Elastic equation. Statically undetermined beams. Method of overlap and its application to the solution of statically indeterminate beams. Energy methods. Deformation energy for normal and cutting stresses. Castigliano's theorem.",
                "ects": 6.0
            },
            {
                "name": "Electronic Power Conversion and Storage",
                "description": "1. The-power semiconductor devices: PN, pin and SiC Schottky diodes; Junction bipolar transistors; MOSFET and IGBT and iegt isolated port bipolar transistors; GTO thyristors and thyristors, IGCT and eto; junction Field effect diodes, transistors and thyristors (FCD, sit, vjfet, BSIT, Sith) itself, SIC and C: characterization, losses, protections and command. Series and parallel associations, cascode generalized.2. -Analysis and Synthesis of electrical power switched electronic conversion topologies: DC-DC, DC-AC, AC-DC and AC-ac.3. -Electrical energy storage devices A.4. -Introduction to the study of linear and non-linear regulation of CCE. CCE linear and non-linear modeling. Synthesis of linear and non-linear compensators and commands for applications in electrical energy storage systems.",
                "ects": 6.0
            },
            {
                "name": "Performance",
                "description": "Revision of basic concepts. Systems and unit dimensions. Newton's laws of motion. Perfect gases. The International Standard Atmosphere. Variation of properties with altitude. Definitions of QFE, QNH, qne, QFF. Pressure altitude, density altitude, temperature altitude. Notions of Aerodynamics (compressibility; viscosity; boundary layer; Reynolds no; Mach no). Speed Measurement (IAS, CAS, EAS, Tas). Description of the flow around a profile (pressure Center; aerodynamic center; polar curves). Description of the flow around a wing. Three-dimensional effects. Aerodynamic devices. Resistance Analysis for an airplane. Mach critical number. Plane flight. Equations. Polar speed. Propulsion Flight. Typical performance curves of velvety and Reaction Engines. Cruise flight. Required impulse curves and impulse available. Movement equations. Lower fuel consumption hourly speeds, lower resistance, greater specific range. Optimum decruzeiro altitude. Economic cruise: operational optimization. Takeoff and landing. Applicable legislation. Limitations. Speed settings. Down and up. Movement equations. Operational ceiling. The flight plan calculation. “Extended twin engine operations” (ETOPS). Notions of spherical trigonometry. Curvilinear flight. Differential movement equations. Loss speeds. Flight domain. Margin of maneuver. Diagram V-N (speed vs load factor).",
                "ects": 4.5
            },
            {
                "name": "Aerospace Engineering Master Thesis",
                "description": "To be defined by the scientific advisor.",
                "ects": 30.0
            },
            {
                "name": "Structural Mechanics",
                "description": "1. Introduction: Revision of the basic equations of elasticity theory. Review of Energy principles in structural mechanics. Revision of the finite element method. 2. Elastic stability: Euler Elastic stability. Concepts and Models of stability, stability of columns and gantries. 3. plate theory: Classical formulation. Plate bending. Resulting efforts. Distribution of normal and cutting stresses. Border conditions. Deformation and displacement. Balance equation. Analytical Methods: rectangular plates. Analytical Methods: circular plates. Variational formulation: approximate Rayleigh-Ritz method. Orthotrophic plates. Reinforced plates. 4. Finite Element Methods: Finite Elements in static of bars, beams and gantries. Calculation of efforts. Thermal voltages. Thin and thick elements. Finite Elements in beam dynamics and gantry. Modal Analysis and transient vibrations. Problem of own values and vectors. Methods of direct integration of dynamic equilibrium equations. Finite Elements in instability of beams and gantries. Critical loads and instability modes. Analytical elements for dynamics and instability of beams and gantries. Finite Elements in elasticity: rectangular and isoparametric elements. Finite Elements in static, dynamic and board instability. Kirchoff (classic) and Mindlin. Contact problems. Errors and convergence. 5. Applications: Application of ANSYS and Matlab programs to static, dynamic and instability analysis of structures and boards.",
                "ects": 6.0
            },
            {
                "name": "Linear and Nonlinear State-Space Control Theory",
                "description": "1. linear models of state space. State equation and its solution. Transition matrix. State achievements. Relations with the transference.2.refeeding of state variables. Controllability/observability. Minimal achievements. Interpretation in terms of poles and zeros. Controller by pole placement through linear state feedback. Method of undetermined coefficients. Bass-Gura formula. Formulas of Ackerman and Mayne-Murdoch. Observers. Separation theorem. Tracking reference.3.non-linear systems. Non-linear systems status model. Analysis on the state plan. Balance points. Linearization. Stability. stability. Relationship between the stability of the balance points of the non-linear system and the linearized system. Examples of qualitative determination of solutions. Second method of Lyapunov. Lyapunov equation. Descriptive function method. Non-linear controls.4.optimal control. Pontryagin principle for fixed terminal time problems and without restrictions in terminal state. Problems with terminal state restrictions. Quadratic linear problem. Gaussian quadratic linear problem (LQG). Kalman filter.",
                "ects": 6.0
            },
            {
                "name": "Circuits Theory and Electronic Fundamentals",
                "description": "1. Circuit Theory: voltage, current, power and resistance; condenser; coil and transformer; frequency response. 2. junction diodes: Features; Zener diode; rectifiers; filtration; limiting circuies.3. Bipolar junction transistors: Main features; emitter follower circuit; emitter amplifier-common; coupling between circuits; Ebers-Moll model; non-ideal characteristics of transistors; current mirrors; by differential.4. Operational Amplifiers: Features; basic mounts.",
                "ects": 6.0
            },
            {
                "name": "Linear Algebra",
                "description": "Resolution of linear equations systems. Method of elimination of Gauss. Matrices and vectors. Linear spaces and linear transformations. Linear independence. Bases and dimension. Core and contradiction of a linear transformation. Internal products and standards. applications to linear differential equations. Orthogonal bases and Gram-Schmidt orthogonization. Orthogonal supplements and projections. Straight equations and plans. Determinants and applications. Own values and vectors. Invariant subspaces. Diagonalization of arrays. Hermitage, anti-Hermitage and unitary transformations. Quadratic shapes.",
                "ects": 6.0
            },
            {
                "name": "Differential and Integral Calculus I",
                "description": "Real numbers (body properties; order ratio and Supreme axiom). Natural numbers. Induction method. Real functions of real variable: limit and continuity; differentiability-fundamental theorems; Cauchy rule and lifting indeterminations; Taylor formula. Primitivation. Integral R calculation: Integral of Riemann; integrability of sectionally continuous functions; fundamental theory of calculation; integration formulas by parts and by substitution. Elementary transcendent functions: Logarithm, exponential and hyperbolic functions. Numerical series: Geometric series; comparison criteria; absolutely converging series; power series",
                "ects": 6.0
            },
            {
                "name": "Aerospace Seminar II",
                "description": "The activities are diverse and must be previously agreed between the students and the responsible teacher. some examples: 1. Carrying out internships in aeronautical industry.2. Participation in international competitions of an educational/formative nature (E.G. Air cargo challenge).3. Dissemination of aerospace engineering to companies, secondary schools and society in geral.4. Support for carrying out laboratory work of disciplines taught by the Department of Mechanical Engineering and Electrical Engineering A.5. Aeronautics Research: Rotary Wing vehicles, take-off or vertical landing jets; robotic aircraft; missiles; satellite launchers; space vehicles.",
                "ects": 1.5
            },
            {
                "name": "Flight Testing",
                "description": "1. introduction. Concept and characterization of tests in flight. Flight Test planning: objectives; definition of the list of parameters to be measured; requirements imposed on the instrumentation system; type of transmission and analysis of required data; maneuvers required in flight; human resources; safety aspects. 2. instrumentation for in-flight testing. Analysis of an instrumentation system for in-flight testing: metrological characteristics; physical requirements; analysis of aircraft safety conditions and instrumentation system; types of instrumentation systems; study of the main components of an instrumentation system; study of the irig-106 standard; analysis of the wharf concept; future developments. Automatic Data Processing and Analysis: Concept, equipment and algorithms. Study of various instrumentation systems for in-flight testing. 3. techniques used in flight tests. General aspects related to the application of in-flight tests in various fields: Measurement and calibration of aerological parameters; flight envelope; flight qualities; performance; aerodynamics; avionic systems; software; noise; propulsion; human factors; cell. Conduct flight tests and analysis of results.",
                "ects": 6.0
            },
            {
                "name": "Antennas and Propagation",
                "description": "The program of this discipline is divided into three complementary blocks: Aspects of electromagnetic field theory. It presents the basic formulation of electromagnetic field theory, first for propagation in unlimited media, then next to the interface of semi-unlimited media, without and with sources ends with guided propagation study on transmission lines and waveguides. antennas. Basic concepts such as radiation diagram, Directivity, impedance, polarization, bandwidth, effective aperture and antenna are presented as an element of a communications system. The theory of antenna aggregates in the perspective of analysis is studied, and several types of potential elemental antennas elements of aggregates are studied. This study is complemented by the approach of several practical aspects related to the manufacture and installation of antennas. Radio spread. Study the influence of the terrain, from the point of view of reflections, attenuation by obstacles and diffraction by the curvature of the Earth. It is also studied the influence of the low atmosphere, and influence on the trajectory of the Rays. Attenuation by atmospheric gases and rain is addressed.",
                "ects": 6.0
            },
            {
                "name": "Thermodynamics I",
                "description": "1. Introductory concepts and definations1.1 definition and description of open systems and locks characterization of properties: temperature, volume and press1.1.3 forms of energy transfera2. The first law of thermodyname2.1 differential and integral forms of the first lei2.2 application to open systems and locks. The second law of thermodyname3.1 enunciated in the second law and corollary3.2 application to open systems and location3.identification of irreversibility4. Entropy 4.1 Clausius inequality and definition of entropia4.2 entropy balance sheets to closed systems and abertos4.3 characterization of reversible processes and isentropic yield of components termodinâmicos5 Exergetic analysis-combination of the first and second leis5.1 definition of exergia5.2 application to open systems and locks 5.3 the thermodynamic project-minimization of the generation of entropia6. Properties of pure substances and equations of state6.1 relations p-v-t6. 2 The ideal gas model and real6.3 uncompressible fluids 7. Thermodynamics relations 7.1 Mathematical relations and maxwell7.2 relationship between thermodynamic properties and their derivations7.3 fundamental equation of substancea8. Thermodynames8.1 cycle of Carnot, Rankine, Brayton, and cooling and heat pump, Otto and diesel",
                "ects": 6.0
            },
            {
                "name": "Machine Elements",
                "description": "First part-gears. Types of gears and their application. Gearing-Definitions and quantitative analysis. Slip and wear. Gear yield. Interference in the gear. Worm gear analysis. Epicyclical trains: Description and sizing. Automobile differential. Car vehicle boxes. Sequencal.2 part 2 command-mechanical transmission elements-shaft joints. Brakes and clutches: description of the main types and their applications.3rd part-hydraulic transmission systems. components. Schematic representation, symbolic and circuit sizing. applications.4 Part 4-Cost Analysis and component selection options",
                "ects": 6.0
            },
            {
                "name": "Dynamics of Mechanical Systems",
                "description": "Introduction: mechanism concepts, kinematic joint, rigid body and flexible body. Two-dimensional and three-dimensional analysis. Cinematic analysis, dynamic analysis and synthesis of mechanisms. Kinematic Analysis: relative coordinates. Equations of constraint, speed and acceleration. Coordinate partition method. Engine constraints. Lagrangean coordinates vs. Cartesian. Flat Cartesian kinematics: Coordinates, constraints and joints. Position, speed and acceleration equations. Cinematic joints. Applications. Planar dynamic analysis: movement equations. Vector forces. Spring-shock absorber-translating and rotating actuator. Reactions due to embarrassment. Lagrange multipliers. Movement equations system. Static balance. Integration. Stabilization of violation of constraints. Applications. Numerical Methods for Ordinary Differential Equations: Runge-Kutta method. Explicit methods. Predictor-corrector methods. Order and variable step algorithms. Dynamic equations with a minimum number of coordinates. Contact/impact of mechanical systems: Applications to vehicle collisions and accident reconstruction.",
                "ects": 6.0
            },
            {
                "name": "Combustion",
                "description": "Combustion in today's world. Thermochemistry. Chemical composition and stoichiometry. Adiabatic flame temperature. Chemical balance. Chemical kinetics. Rate and constant reaction. Reaction mechanisms. Conservation equations for reactive systems. Mixture fraction. Gaseous fuels, liquids and solids. Spontaneous and forced ignition. Laminar premix flames. Structure and flame propagation speed. Flammability limits. Return of flame and quenching. Laminar diffusion flames. Isothermal or combustion laminar jet. Turbulent flames. Flame Propagation speed. Perfect mixing reactor. Flame stabilization. Evaporation and combustion of a drop of fuel. Atomization and sprays. Combustion of sprays. Flames of solid fuels. Combustion of a carbon particle. Combustion of suspended particles, grate and fluidized bed. Types of pollutants. Training mechanisms and emission control methods.",
                "ects": 6.0
            },
            {
                "name": "Aerodynamics II",
                "description": "Chapter I Waves in gás1.1 flows fundamental equations of fluid flows. 1.2 Introduction to the method of characteristics. 1.4 Waves in supersonic stationary fluids ideal normal shock wave and oblid.1.3 corner-centered expansion shock wave,(Prandtl-Meyer). 1.5 Non-stationary compressible flow. Chapter II. Two-dimensional potential model linearized for small disturbances. 2.1 Potential model linearized. 2.2 Alar profiles in transosnicum running.2.3 Alar profiles in supersosnicum stationary running.2.4 introduction to hypersonic running.chapter III. Potential model three-dimensional linearized for small disruptions.3.1 wings in subsonic running.3.2 wings in supersonic running.3.3 bodies of revolution in supersonic running.chapter IV layer limite.4.1. 2D laminar boundary layer in compressive fluid running.4.2 turbulent 2D boundary layer in compressive fluid running.4.3 interaction shock layer limite.4.4 boundary layer tops3d.4.5 topics on laminar regime transition to turbulent.",
                "ects": 6.0
            },
            {
                "name": "Aerodynamics I",
                "description": "-Cap. 4: laminar boundary layer (pp. 210-225)-chap. 5: Laminar/turbulent transition (pp. 226-241)-chap. 6: Turbulent flow (pp. 242-325, 334-347)-chap. 7: tri-dimensional boundary layer (pp. 348-388)-chap. 9: Alar profiles (pp. 459-512, 518-549)-chap. 10: finite wings (pp. 553-603) note: Chapters and page numbers refer to those in the textbook.",
                "ects": 6.0
            }
        ]
    }
}